Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoints Method (Int32, StringList)
 Requests N picks of points from the user. Returns the picked points in the view coordinates and the view in which the pick occurred.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Tuple<PointList, ViewBase> PickPoints(
	int numberOfPicks,
	StringList prompts
)
Public Function PickPoints (
	numberOfPicks As Integer,
	prompts As StringList
) As Tuple(Of PointList, ViewBase)
Parameters
numberOfPicks
Type: System.Int32
The number of requested picks.
prompts
Type: Tekla.Structures.Drawing.StringList
The prompts shown in the status bar before the picks. See the class remarks for more information about prompts.
Return Value
Type: Tuple<PointList, ViewBase>
[Missing <returns> documentation for "M:Tekla.Structures.Drawing.UI.Picker.PickPoints(System.Int32,Tekla.Structures.Drawing.StringList)"]
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
PickPoints Overload
Tekla.Structures.Drawing.UI Namespace